common/models/Config.php

SELECT * FROM `t_config` WHERE `id`=25
---
	public static function getHtmlStatus($id){
		if(isset(self::findOne($id)->status) && self::findOne($id)->status==0){