common/models/Content.php

SELECT * FROM `b_content` WHERE `id`=7
---
    public static function findModel($id)
    {
        if (($model = Content::findOne($id)) !== null) {