common/models/Cuser.php

SELECT `province_id`, `isub` FROM `c_user` WHERE `province_id`=110000
---
    public static  function findIsubData($province_id)
    {
        $isubData = Yii::$app->memcache->get('isubData'.$province_id);
        if(!$isubData){
            $isubData = Cuser::find()->select('province_id,isub')->where(['province_id'=>$province_id])->asArray()->all();