common/models/Operation.php

    public static function isSub($id)
    {
        return Operation::findOne(['uuid' => $id,'type'=>2]);
---
SELECT * FROM `c_operation` WHERE (`uuid`=24) AND (`type`=2)