common/models/Wuser.php

SELECT * FROM `c_wuser` WHERE `unionid`='osofs5x8_HkB4bGJSxu0FB6x8fb8'
---
    public static function findByUnionid($unionid)
    {
        return Wuser::findOne(['unionid' => $unionid]);