backend/modules/rbac/controllers/ContentController.php

    protected function findModel($id)
    {
        if (($model = Content::findOne($id)) !== null) {
---
SELECT * FROM `b_content` WHERE `id`='6'

    public function actionItem($province_id)
    {
        $model = new Content();

        $cond = ['province_id' => $province_id];

        $items = $model->find()->where($cond)->with(['inform'=>function($query){$query->andWhere('status = 1');}])->orderBy(['status'=>SORT_DESC,'sort'=>SORT_DESC,'created_at'=>SORT_DESC])->asArray()->all();
---
SELECT * FROM `b_content` WHERE `province_id`='110000' ORDER BY `status` DESC, `sort` DESC, `created_at` DESC
SELECT * FROM `b_inform` WHERE (status = 1) AND (`content_id` IN ('7', '6', '8'))