backend/modules/rbac/controllers/CuserController.php

    public function actionOperation($uuid)
    {

        $model = new operation();

        $cond = ['uuid' => $uuid];

        $onetype = array();

        $twotype = array();
        //$items = $model->find()->where($cond)->with('operation')->orderBy(['created_at'=>SORT_DESC])->asArray()->all();

        $items = $model->find()->where($cond)->with(['province'=>function($query){$query->select('name,province_id');}])->orderBy(['created_at'=>SORT_DESC])->asArray()->all();
---
SELECT `name`, `province_id` FROM `b_province` WHERE `province_id` IN ('420000', '440000', '110000')

    protected function findModel($id)
    {
        if (($model = Cuser::findOne($id)) !== null) {
---
SELECT * FROM `c_user` WHERE `id`='1'