backend/modules/rbac/controllers/InformController.php

SELECT * FROM `b_inform` WHERE `id`='11'
---
    protected function findModel($id)
    {
        if (($model = Inform::findOne($id)) !== null) {