backend/modules/rbac/controllers/MenuController.php

SELECT * FROM `t_menu` WHERE `id`='35'
---
    protected function findModel($id)
    {
        if (($model = Menu::findOne($id)) !== null) {