backend/modules/rbac/controllers/ProvinceController.php

    protected function findModel($id)
    {
        if (($model = Province::findOne($id)) !== null) {
---
SELECT * FROM `b_province` WHERE `id`='2'

    public function actionTestView($limit)
    {

        $sql = Province::find();

        $total = $sql->count();//总共有多少数据

        $pager = new Pagination(['totalCount' => $total,'pageSize'=>$limit]);//分页

        $items = $sql->offset($pager->offset)->limit($limit)->all();
---
SELECT * FROM `b_province` WHERE `id`='2'