backend/modules/system/controllers/ConfigController.php

    protected function findModel($id)
    {
        if (($model = Config::findOne($id)) !== null) {
---
SELECT * FROM `t_config` WHERE `id`='25'